Revit 2023 API
Application.OpenBuildingComponentDocument Method
 Opens a Building Component document from disk.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public virtual Document OpenBuildingComponentDocument(
	string fileName
)
Visual Basic
Public Overridable Function OpenBuildingComponentDocument ( _
	fileName As String _
) As Document
Visual C++
public:
virtual Document^ OpenBuildingComponentDocument(
	String^ fileName
)
Parameters
fileName
Type: System.String
The Building Component file to be opened.
Remarks
 The opened document is a family document.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException | If null is passed as 'fileName'.
Autodesk.Revit.Exceptions.ArgumentException |  If 'fileName' is an empty string or it is not an Autodesk Exchange file name.
Autodesk.Revit.Exceptions.FileArgumentNotFoundException | If the file specified by 'fileName' cannot be found.
Autodesk.Revit.Exceptions.InvalidOperationException | If the Building Component file cannot be opened.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace